app/views/components/_follow_button.html.erb

          <% else %>
              <%= form_for(current_user.active_relationships.find_by(follower_id: user.id), html: { method: :delete }) do |f| %>
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follower_id" = ? LIMIT 1  [["user_id", 5], ["follower_id", 5]]