app/views/pages/explore.html.erb

            <div class="col-sm-10 col-sm-offset-1">
              <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> -
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]

        <h5 style="color: grey; font-size: 125%"> who to follow</h5>
        <% @user = User.all %>
---
SELECT "users".* FROM "users"