app/views/pages/home.html.erb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]
---
            <div class="col-sm-6" style="font-size: 80%; opacity: 0.7;">POSTS<br>
              <h6 style="color: #0084B4; font-size: 200%;"><%= current_user.posts.count %></h6>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
---
            <div class="col-sm-10 col-sm-offset-1">
              <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> -