app/views/pages/profile.html.erb

            <div class="col-sm-10 col-sm-offset-1">
              <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> -
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "John"]]
SELECT "posts".* FROM "posts" WHERE (user_id = 4)  ORDER BY "posts"."created_at" DESC

        <h5 style="color: grey; font-size: 125%"> who to follow</h5>
        <% @user = User.all%>
---
SELECT "users".* FROM "users"