app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def home
    @posts = Post.all

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "John"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT "posts"."id" FROM "posts" WHERE (user_id = NULL)  ORDER BY "posts"."created_at" DESC
---
  def profile
    begin
      @user = User.find_by_username(params[:username])
    rescue
      redirect_to root_path, notice: "user not found"
    end
    @posts = Post.where("user_id = ?", @user.try(:id))