app/controllers/posts_controller.rb

INSERT INTO "posts" ("user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 5], ["comment", "Comment new"], ["created_at", "2017-08-21 22:58:35.515358"], ["updated_at", "2017-08-21 22:58:35.515358"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.save