app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:follower_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]

  def destroy
    @user = Relationship.find(params[:id]).follower
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follower_id" = ? LIMIT 1  [["user_id", 5], ["follower_id", 3]]